cask_args appdir: "/Applications", require_sha: true
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

brew "bash"
brew "black", restart_service: :changed
brew "fx"
brew "gh"
brew "git"
brew "git-lfs"
brew "gnupg"
brew "gnu-sed"
brew "gnu-tar"
brew "go"
brew "grep"
brew "httpie"
brew "jq"
brew "mas" if OS.mac?
brew "media-info"
brew "mp4v2"
brew "mypy"
brew "openssh"
brew "pinentry"
brew "pipx"
brew "pnpm"
brew "pre-commit"
brew "prettier"
brew "python"
brew "r"
brew "rust"
brew "shellcheck"
brew "shfmt"
brew "starship"
brew "typescript"
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

cask "1password"
cask "brave-browser"
cask "docker"
cask "firefox"
cask "karabiner-elements"
cask "kitty"
cask "postman"
cask "visual-studio-code"
cask "vlc"
cask "zotero" # no arm64_big_sur yet

mas "bear", id: 1091189122
mas "cascadea", id: 1432182561
mas "daisydisk", id: 411643860
mas "duckduckgo privacy essentials", id: 1482920575
mas "keynote", id: 409183694
mas "numbers", id: 409203825
mas "pages", id: 409201541
mas "pdf expert", id: 1055273043
